# oridic = "黑母=自然之母=黑暗之母=大地之母\n\
# 格林斯=格蕾丝=格莫瑞\n\
# 阿努比斯=阿拉比斯=阿奴比特=百勒努斯\n\
# 黑夫人=灰夫人\n\
# 部落赛欧=洛欧塞布=沉默绝杰 鲁鲁纳伊\n\
# 戒卡=卡戎\n\
# 吸魂巫术=灵魂转移\n\
# 趣味之魂=恶趣之魂\n\
# 阿古斯=禁断之腕 尼古拉\n\
# 噩梦/做梦=死梦少女/深渊之梦\n\
# 紫之魔女=丹紫抵御者 安镍儿\n\
# 机械贞德=天鸣巨骸\n\
# 猎犬=死尸犬\n\
# 暗夜魔兽猎手=魔兽掌控者=死灵聚集体 鲁蓓露\n\
# 猫=死灵兽群(鲁蓓露的token)\n\
# 镑佬的弟弟=莫迪凯\n\
# 梦加耶得=孟加拉得=耶梦加得\n\
# 自残少女=邪眼恶魔\n\
# 超级邪蝙蝠=噬暗巨蝠\n\
# 真红魔女=绯红抗战者 莫诺\n\
# 机械伯爵=钢之吸血鬼 诗雷\n\
# 尼禄=宿命宣读者 露妮\n\
# 邪恶儿童=神托的妖童 阿鲁鲁梅亚\n\
# 开辟使者=开辟的预言者(20姐)\n\
# 异界侦察者=异界传送者=异界入侵者 巴吉利斯\n\
# 无门乱斗=无心之斗\n\
# 本我的解放=机械的解放\n\
# 屋子=人偶房\n\
# 究极机械王=百机之王 格莱亚斯\n\
# 眼镜娘=天空指挥官 谢丽娅\n\
# 狂暴长枪手=狂岚枪兵\n\
# 黑白对打=白与黑的激斗\n\
# 巴巴托斯=巴巴罗萨\n\
# 约瑟夫=雷瑟夫=雷瑟姆\n\
# 尸体哥=炎狮大将军\n\
# 隐刀=隐伏天诛+刺客\n\
# 夏利=苍空剑士 莉夏\n\
# 圣堂刺客=ta=夜月之刃 里欧德\n\
# 圣剑=白刃乱舞\n\
# 地球仪=天球仪\n\
# 万象之风=天气之风=返祖之灵=天象之风 佩德菈\n\
# ddk=咚得尅=圣弓使役者 库鲁特\n\
# 空之剑=复仇的白刃 阿尼耶斯\n\
# 圣枪术士=审判之圣枪执行者\n\
# 闪斧=煌刃战士 贝鲁\n\
# 尼姆=精灵锻造师 蕾妮\n\
# 妖精奴隶主=妖精使役者\n\
# 帕梅拉=天赋射手 梅提拉\n\
# *帕梅拉是巫师/妖精虹卡\n\
# 碧蓝斧手=翠岚的大斧手\n\
# 修草师=树艺师 莱拉\n\
# 穿透哥=763机攻枪精灵\n\
# 剧毒术士=猛毒公主 莉柯瑞丝\n\
# 机械灰夫人=钢甲龙骑士 拜伦\n\
# 邪恶龙骑士=森林之影 拜迪"

# mid_dic = oridic.split("\n")
# final_dic = {}

# for word in mid_dic:
#     word = word.split("=")
#     for i in range(len(word)-1):
#         final_dic[word[i]] = word[-1]

# print(final_dic)

saying = ['''虽然之前就大致能看出来 复仇肯定是人没了，不过好歹还是要等个gg的理由，现在虹出了已经可以打gg了

江底陪吸血鬼去了，这个感觉没任何疑问吧，泥潭应该不会有人觉得复仇不会不下水道吧。。。

主教最后补了一张究极假卡。首先主教肯定是夺冠了，现在其实主要思考的还瘦主教哪套最厉害。 自然 墙 耶拉。

我说下我个人的观点，我觉得挂疾走的墙教是我最看好的。

如果不带自然就是是在墙教的基础上，携带3张神圣鸟笛，和喵鲁，配合隐匿圣堂，敲钟，狮鹫兽 浓度足够，这样也可以投入孤儿院长。

这种构筑 在中期压力很大，比如前面堆叠过圣骑兵，打出5费将军会是很强的一手buff 或者堆叠护符以后出孤儿院打伤害，后期有6张疾走，圣将军的buff也有一定的斩杀能力。 而且全能骑士3费新金，之前堆叠过buff的话 其实5费打基本无敌 一个大生物突进双解

或者就是自然体系挂3张443和隐秘圣堂或者斧王6费虹，不过自然的卡位紧张 这样做等于厨师是不可能有卡位带了，ddk可能也不能带满 当然换来了廉价的伤害 肯定还是值的

基本上我看好这2种构建之一og, 主教sv上帝说''',
'''这张虹 硬实力其实很强，只看硬实力能拿个8分，但是轮换自残已经人没了。 色情一家全退，自残源都是个问题，剩下的铜银就算补几张也很难达到支撑卡组的需求。。 然后以利雅和狼人，都是打反场的支点卡，即没有强力的铺场也没有伤害终端， 连大腿色情姐和猪都没了，想打最少也要dlc

然后鬼毫无老底，要是姑且有点老底这版本也不至于下水道。 自然体系倒数第二弱 一堆3线队员， 复仇机械现在也没有啥太大5补强。

我觉得是要淹死下水道了''',


'''水友们 我感觉下版本nec已经坐上飞机准备起飞了 你们怎么看

首先火车头，相当于nec版本厨师，不过21跟12比起来交换能力要好很多。 可以检索的牌也相当定性 一键拿回2个key

酒吞基本是起飞水平的牌，414必杀 只能是稍微小亏的一手 但是绝对可以接受，2妹下得去 我凭什么下不去，拿一个非常强的主战特效，配合狗或者狐狸完全ok

狐狸直接起飞了，其实不光本体 哪怕当激情演奏5做都不亏 能给托托做3个任务。 当然比起拉拉我更看好用千金启动，千金减一下 7t直接丢一场 而且自带亡语基本是完美适合托托。

感觉几张牌 不管是搭载现在的自然死，还是新思路可能出现的送葬拉拉之类的

<硬实力>肯定是没问题，起码有个lgd水准，我10年老nec 感觉应该奶不死''','''首先nec肯定不能优开主教，我觉得是55开 nec甚至偏小劣。

这版本别的我打了200多盘nec,有一个纯nec从0打到gm的小号，之后也一直在玩这个卡组，理解基本拉满

其他对局的话 打自然elf82开对局闭眼打都能赢，打虫妖劣一些 不过也就是无脑走脸也没什么说的，内战则基本是一个纯粹的运气对决，你有暗夜魔兽猎手对面没有你就赢，都有谁先手谁就赢。。。真的没什么技巧。

不过跟主教和皇室这2个卡组打的时候，我觉得还是有非常多的技巧的，今天主要说一下打主教。打皇的看心情也许会有也许没了

掌握致胜点，nec可以打低节奏

nec打主教怎么赢，2边都不丢人的情况下，nec可以打赢主教，一定是拖到后盘。

而致胜的key在于暗夜魔兽猎手(535)，这张卡不止是打主教在打所有职业都是nec能不能赢的关键。 首先这张卡在出场，可以打回一个稳定的先手，最关键的是她在先手权站场的同时，可以直接做任务进度和大幅度的过牌。

也就是说你在打出第一个猎手以后，他带来的过牌资源能让你抽到第二个猎手(535)，托特，黑暗树母等。
相反你如果抽不到猎手(535)，那么及时你前期拿到了优势，做完了托托，也会因为没有过牌资源最终死于没有资源。

那么nec在打主教的时候，可以通过传统的中速场面压制在没有535赢主教吗，我的答案是不能，只要主教抽的不丢人，其实韧性是相当强的，大量的反场，回血以及老鼠公主巨大的一波资源补充，我们就算靠中前期的排序拿到了一些优势，在没有运营魔兽猎手的情况随时必都会被主教翻盘。

用dota2举个例子，nec相当于再打一套gank4保1单核的阵容，前期有一定的战斗力，但是终结比赛还是要靠”核”。

nec前期场优的意义在于拖消耗主教的进攻节奏，比如你有了场优可以让主教把本来更好的其他资源被迫交掉，例如 被迫拖节奏打了奶弓，用结晶解了黑暗母亲，魔兽猎手以外的生物，45被迫提前冲出等等。

不过归根结底，我们所有操作都是围绕着如何运营魔兽猎手535这个”核”来进行，就像你打dot你4个人在肥，自己的单核不肥，最后只能被翻盘然后被对面游泳。

所以，nec打主教，永远的思路都是要在6t舒服的出魔兽猎手，场优是手段不是目的。

基于这点，如果主教前期打的节奏不高，我们就完全可以继续打低节奏开休息。这么说吧，只要我手里同时有休息和魔兽猎手，我一点要找出一个机会在5t之前出掉这张休息。 这样我在6t就有3猫的一波，3猫和双猫带来的后续运营差距是巨大的。

一般几个开休息的实时机:

先手4t,这是最佳的打休息的回合
5t的时候，可以进化一个2t哪怕撞掉让场面，只要博取到一个开休息的机会也是赚的

当然主教如果打的不紧凑，有让你开休息的时机，那自然不要错过

了解主教的致胜点，死亡树母必须吃到845

主教要怎么赢nec, 一个有经验的主教肯定也知道2点，跟nec拖后期结果就是自己一定被游泳，而一波不够足够爆发的场面也会被nec解掉 导致拖后最后被游泳。

所以主教的策略一定是配合45做一波大场，哪怕nec能清掉一部分也会造成留场，最后用伤害补死。

一般来讲，主教最大的爆发来源在于7t和8t， 所以我们必须要在这2t 提前留好能打这一波的资源。 最好反场的就是暗影树母。 如果没有树母上手，则要规划其他解法。

这里一定要注意，这个解场，不是你到了才想，而是你在56t就要考虑怎么留牌 留好资源来解这一波。 除了树母，规划好吃豆拳击手，狗等等 除此之外，冥姐是带必杀的，这点也完全可以用来解场。按照对面有045来提前预判好这一波的解场 是关键

其他操作

托托随便卖，拳击手能留就留

在起手拿到的2费中，可以完全不考虑托托卖起来一点也不用心疼。

道理很简单，如果你用魔兽猎手过了一波资源，抽到第二托托的概率不低，而就算没有托托 只要你魔兽猎手过上来资源，有树母 姐弟之类的不靠托托也能赢。

而拳击手则是最关键的2费，这种牌的解5可以知己重拳出击击杀奶弓，545。 在6t如果我们成功靠猎手省了一个豆，那么拳击手会成为解主教一波的究极关键牌之一，在5t也能完美的打出先手节奏 帮你打休息所以这张牌是2费里最值钱的，能抠住就尽量不要卖

先手小狗直接出

这个不仅是打主教，打其他职业我都会这么做。现在环境 没有人会放112 也就是说我先手出狗，对面不交魔法解我可以活到4费，这能打出很好的前期节奏，而中间只要靠树膨胀过一次，就是大赚，而对面如果把一张宝贵的结晶交在狗上，那就是血赚。 总之先手出狗，只有赚 没有任何赔的可能性

先手4t保持2频率或者死过321

先手4t一点要有2频率或者死过321， 否则如果主教在4t出了老鼠公主 111卡住，你5t没双解，这盘直接输，这个风险太大了 必须防

留牌

看不到魔兽猎手的情况，只留荒野探索者，不留其他任何2费全换找魔兽猎手。 开头已经说过 这个对决如果我们不打出魔兽猎手，是不可能赢的，而nec的2费曲线巨多，很难出现2费没牌打的情况。 全换没任何问题，不过探索者可以留，因为这张卡 2费出收益巨大，但是你一但有树 这卡就是白板，还是要把他早点打出去。

在看得到魔兽猎手的情况下先手可以留321，后手可以留拳击手''']

final = []

for paragraph in saying:
    paragraph = paragraph.split("\n\n")
    for sentence in paragraph:
        if len(sentence) > 20:
            final.append(sentence)
print(final)